#include <iostream>
using namespace std;

int main() {
    int h1,m1,s1,h2,m2,s2,x;
    cout << "Введите время начала временного отрезка" << "\n"; // Ввод начала временного промежутка
    cout << "Часы: " << "\n";
    cin >> h1;
    cout << "Минуты: " << "\n";
    cin >> m1;
    cout << "Секунды: " << "\n";
    cin >> s1;

    cout << "Введите время конца временного отрезка" << "\n"; // Ввод начала временного промежутка
    cout << "Часы: " << "\n";
    cin >> h2;
    cout << "Минуты: " << "\n";
    cin >> m2;
    cout << "Секунды: " << "\n";
    cin >> s2;

    x = (h2 * 60 * 60 + m2 * 60 + s2) - (h1 * 60 * 60 + m1 * 60 + s1);

    cout << "Временной промежуток равен: " << "\n";
    cout << "Часы " <<  x / 3600 << " Минуты " << (x % 3600) / 60 << " Секунды "  << (x % 3600) % 60;
    return 0;
}
